MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/spi/processor/spi_p32mx695f512h.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _SPI_P32MX695F512H_H
#define _SPI_P32MX695F512H_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    SPI_ID_3 = 0,
    SPI_ID_2,
    SPI_ID_4,
    SPI_NUMBER_OF_MODULES

} SPI_MODULE_ID;

typedef enum {

    SPI_INPUT_SAMPLING_PHASE_IN_MIDDLE = 0,
    SPI_INPUT_SAMPLING_PHASE_AT_END = 1

} SPI_INPUT_SAMPLING_PHASE;

typedef enum {

    SPI_OUTPUT_DATA_PHASE_ON_IDLE_TO_ACTIVE_CLOCK = 0,
    SPI_OUTPUT_DATA_PHASE_ON_ACTIVE_TO_IDLE_CLOCK = 1

} SPI_OUTPUT_DATA_PHASE;

typedef enum {

    SPI_COMMUNICATION_WIDTH_8BITS = 0,
    SPI_COMMUNICATION_WIDTH_16BITS = 1,
    SPI_COMMUNICATION_WIDTH_32BITS = 2

} SPI_COMMUNICATION_WIDTH;

typedef enum {

    SPI_CLOCK_POLARITY_IDLE_LOW = 0,
    SPI_CLOCK_POLARITY_IDLE_HIGH = 1

} SPI_CLOCK_POLARITY;

typedef enum {

    SPI_FIFO_INTERRUPT_WHEN_TRANSMIT_BUFFER_IS_NOT_FULL = 0,
    SPI_FIFO_INTERRUPT_WHEN_TRANSMIT_BUFFER_IS_1HALF_EMPTY_OR_MORE = 1,
    SPI_FIFO_INTERRUPT_WHEN_TRANSMIT_BUFFER_IS_COMPLETELY_EMPTY = 2,
    SPI_FIFO_INTERRUPT_WHEN_TRANSMISSION_IS_COMPLETE = 3,
    SPI_FIFO_INTERRUPT_WHEN_RECEIVE_BUFFER_IS_FULL = 4,
    SPI_FIFO_INTERRUPT_WHEN_RECEIVE_BUFFER_IS_1HALF_FULL_OR_MORE = 5,
    SPI_FIFO_INTERRUPT_WHEN_RECEIVE_BUFFER_IS_NOT_EMPTY = 6,
    SPI_FIFO_INTERRUPT_WHEN_BUFFER_IS_EMPTY = 7

} SPI_FIFO_INTERRUPT;

typedef enum {

    SPI_ERROR_INTERRUPT_NOT_SUPPORTED = 0

} SPI_ERROR_INTERRUPT;

typedef enum {

    SPI_PIN_SLAVE_SELECT = 0,
    SPI_PIN_DATA_OUT = 1

} SPI_PIN;

typedef enum {

    SPI_FIFO_TYPE_RECEIVE = 0,
    SPI_FIFO_TYPE_TRANSMIT = 1

} SPI_FIFO_TYPE;

typedef enum {

    SPI_BAUD_RATE_CLOCK_NOT_SUPPORTED = 0

} SPI_BAUD_RATE_CLOCK;

typedef enum {

    SPI_FRAME_SYNC_PULSE_ON_EVERY_DATA_CHARACTER = 0,
    SPI_FRAME_SYNC_PULSE_ON_EVERY_2_DATA_CHARACTER = 1,
    SPI_FRAME_SYNC_PULSE_ON_EVERY_4_DATA_CHARACTER = 2,
    SPI_FRAME_SYNC_PULSE_ON_EVERY_8_DATA_CHARACTER = 3,
    SPI_FRAME_SYNC_PULSE_ON_EVERY_16_DATA_CHARACTER = 4,
    SPI_FRAME_SYNC_PULSE_ON_EVERY_32_DATA_CHARACTER = 5

} SPI_FRAME_SYNC_PULSE;

typedef enum {

    SPI_FRAME_PULSE_POLARITY_ACTIVE_LOW = 0,
    SPI_FRAME_PULSE_POLARITY_ACTIVE_HIGH = 1

} SPI_FRAME_PULSE_POLARITY;

typedef enum {

    SPI_FRAME_PULSE_DIRECTION_OUTPUT = 0,
    SPI_FRAME_PULSE_DIRECTION_INPUT = 1

} SPI_FRAME_PULSE_DIRECTION;

typedef enum {

    SPI_FRAME_PULSE_EDGE_PRECEDES_FIRST_BIT_CLOCK = 0,
    SPI_FRAME_PULSE_EDGE_COINCIDES_FIRST_BIT_CLOCK = 1

} SPI_FRAME_PULSE_EDGE;

typedef enum {

    SPI_FRAME_PULSE_WIDTH_ONE_CLOCK_WIDE = 0,
    SPI_FRAME_PULSE_WIDTH_ONE_WORD_LENGTH = 1

} SPI_FRAME_PULSE_WIDTH;

typedef enum {

    SPI_AUDIO_PROTOCOL_NOT_SUPPORTED = 0

} SPI_AUDIO_PROTOCOL;

typedef enum {

    SPI_AUDIO_TRANSMIT_MODE_NOT_SUPPORTED = 0

} SPI_AUDIO_TRANSMIT_MODE;

typedef enum {

    SPI_AUDIO_ERROR_NOT_SUPPORTED = 0

} SPI_AUDIO_ERROR;

typedef enum {

    SPI_AUDIO_COMMUNICATION_WIDTH_NOT_SUPPORTED = 0

} SPI_AUDIO_COMMUNICATION_WIDTH;

PLIB_INLINE SFR_TYPE* _SPI_FRAMED_COMMUNICATION_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3CON;
        case SPI_ID_2 :
            return &SPI2CON;
        case SPI_ID_4 :
            return &SPI4CON;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_FRAME_SYNC_PULSE_DIRECTION_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3CON;
        case SPI_ID_2 :
            return &SPI2CON;
        case SPI_ID_4 :
            return &SPI4CON;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_FRAME_SYNC_PULSE_POLARITY_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3CON;
        case SPI_ID_2 :
            return &SPI2CON;
        case SPI_ID_4 :
            return &SPI4CON;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_SLAVE_SELECT_CONTROL_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3CON;
        case SPI_ID_2 :
            return &SPI2CON;
        case SPI_ID_4 :
            return &SPI4CON;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_FRAME_SYNC_PULSE_WIDTH_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3CON;
        case SPI_ID_2 :
            return &SPI2CON;
        case SPI_ID_4 :
            return &SPI4CON;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_FRAME_SYNC_PULSE_COUNTER_PIC32_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3CON;
        case SPI_ID_2 :
            return &SPI2CON;
        case SPI_ID_4 :
            return &SPI4CON;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_FRAME_SYNC_PULSE_EDGE_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3CON;
        case SPI_ID_2 :
            return &SPI2CON;
        case SPI_ID_4 :
            return &SPI4CON;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_FIFO_CONTROL_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3CON;
        case SPI_ID_2 :
            return &SPI2CON;
        case SPI_ID_4 :
            return &SPI4CON;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_ENABLE_CONTROL_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3CON;
        case SPI_ID_2 :
            return &SPI2CON;
        case SPI_ID_4 :
            return &SPI4CON;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_STOP_IN_IDLE_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3CON;
        case SPI_ID_2 :
            return &SPI2CON;
        case SPI_ID_4 :
            return &SPI4CON;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

