MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/spi/processor/spi_p32mx695f512h.h
PLIB_INLINE SFR_TYPE* _SPI_PIN_CONTROL_SDO_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3CON;
        case SPI_ID_2 :
            return &SPI2CON;
        case SPI_ID_4 :
            return &SPI4CON;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_MODE32_COMMUNICATION_WIDTH_PIC32_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3CON;
        case SPI_ID_2 :
            return &SPI2CON;
        case SPI_ID_4 :
            return &SPI4CON;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_MODE16_COMMUNICATION_WIDTH_PIC32_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3CON;
        case SPI_ID_2 :
            return &SPI2CON;
        case SPI_ID_4 :
            return &SPI4CON;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_INPUT_SAMPLE_PHASE_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3CON;
        case SPI_ID_2 :
            return &SPI2CON;
        case SPI_ID_4 :
            return &SPI4CON;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_OUTPUT_DATA_PHASE_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3CON;
        case SPI_ID_2 :
            return &SPI2CON;
        case SPI_ID_4 :
            return &SPI4CON;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_PIN_CONTROL_SS_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3CON;
        case SPI_ID_2 :
            return &SPI2CON;
        case SPI_ID_4 :
            return &SPI4CON;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_CLOCK_POLARITY_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3CON;
        case SPI_ID_2 :
            return &SPI2CON;
        case SPI_ID_4 :
            return &SPI4CON;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_MASTER_CONTROL_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3CON;
        case SPI_ID_2 :
            return &SPI2CON;
        case SPI_ID_4 :
            return &SPI4CON;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_TX_FIFO_INTERRUPT_MODE_PIC32_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3CON;
        case SPI_ID_2 :
            return &SPI2CON;
        case SPI_ID_4 :
            return &SPI4CON;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_RX_FIFO_INTERRUPT_MODE_PIC32_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3CON;
        case SPI_ID_2 :
            return &SPI2CON;
        case SPI_ID_4 :
            return &SPI4CON;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_RX_FIFO_COUNT_PIC32_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3STAT;
        case SPI_ID_2 :
            return &SPI2STAT;
        case SPI_ID_4 :
            return &SPI4STAT;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_TX_FIFO_COUNT_PIC32_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3STAT;
        case SPI_ID_2 :
            return &SPI2STAT;
        case SPI_ID_4 :
            return &SPI4STAT;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_BUS_STATUS_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3STAT;
        case SPI_ID_2 :
            return &SPI2STAT;
        case SPI_ID_4 :
            return &SPI4STAT;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_TRANSMIT_UNDER_RUN_STATUS_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3STAT;
        case SPI_ID_2 :
            return &SPI2STAT;
        case SPI_ID_4 :
            return &SPI4STAT;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_FIFO_REGISTER_EMPTY_STATUS_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3STAT;
        case SPI_ID_2 :
            return &SPI2STAT;
        case SPI_ID_4 :
            return &SPI4STAT;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_RECEIVER_OVERFLOW_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3STAT;
        case SPI_ID_2 :
            return &SPI2STAT;
        case SPI_ID_4 :
            return &SPI4STAT;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_RECEIVE_FIFO_STATUS_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3STAT;
        case SPI_ID_2 :
            return &SPI2STAT;
        case SPI_ID_4 :
            return &SPI4STAT;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_TRANSMIT_BUFFER_EMPTY_STATUS_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3STAT;
        case SPI_ID_2 :
            return &SPI2STAT;
        case SPI_ID_4 :
            return &SPI4STAT;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_TRANSMIT_BUFFER_FULL_STATUS_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3STAT;
        case SPI_ID_2 :
            return &SPI2STAT;
        case SPI_ID_4 :
            return &SPI4STAT;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

