MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/spi/processor/spi_p32mx695f512h.h
PLIB_INLINE SFR_TYPE* _SPI_RECEIVE_BUFFER_STATUS_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3STAT;
        case SPI_ID_2 :
            return &SPI2STAT;
        case SPI_ID_4 :
            return &SPI4STAT;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_BUFFER_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3BUF;
        case SPI_ID_2 :
            return &SPI2BUF;
        case SPI_ID_4 :
            return &SPI4BUF;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _SPI_BAUD_RATE_VREG(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return &SPI3BRG;
        case SPI_ID_2 :
            return &SPI2BRG;
        case SPI_ID_4 :
            return &SPI4BRG;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAMED_COMMUNICATION_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_FRMEN_MASK;
        case SPI_ID_2 :
            return _SPI2CON_FRMEN_MASK;
        case SPI_ID_4 :
            return _SPI4CON_FRMEN_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_DIRECTION_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_FRMSYNC_MASK;
        case SPI_ID_2 :
            return _SPI2CON_FRMSYNC_MASK;
        case SPI_ID_4 :
            return _SPI4CON_FRMSYNC_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_POLARITY_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_FRMPOL_MASK;
        case SPI_ID_2 :
            return _SPI2CON_FRMPOL_MASK;
        case SPI_ID_4 :
            return _SPI4CON_FRMPOL_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_SLAVE_SELECT_CONTROL_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_MSSEN_MASK;
        case SPI_ID_2 :
            return _SPI2CON_MSSEN_MASK;
        case SPI_ID_4 :
            return _SPI4CON_MSSEN_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_WIDTH_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_FRMSYPW_MASK;
        case SPI_ID_2 :
            return _SPI2CON_FRMSYPW_MASK;
        case SPI_ID_4 :
            return _SPI4CON_FRMSYPW_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_COUNTER_PIC32_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_FRMCNT_MASK;
        case SPI_ID_2 :
            return _SPI2CON_FRMCNT_MASK;
        case SPI_ID_4 :
            return _SPI4CON_FRMCNT_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_EDGE_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_SPIFE_MASK;
        case SPI_ID_2 :
            return _SPI2CON_SPIFE_MASK;
        case SPI_ID_4 :
            return _SPI4CON_SPIFE_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FIFO_CONTROL_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_ENHBUF_MASK;
        case SPI_ID_2 :
            return _SPI2CON_ENHBUF_MASK;
        case SPI_ID_4 :
            return _SPI4CON_ENHBUF_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_ENABLE_CONTROL_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_ON_MASK;
        case SPI_ID_2 :
            return _SPI2CON_ON_MASK;
        case SPI_ID_4 :
            return _SPI4CON_ON_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_STOP_IN_IDLE_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_SIDL_MASK;
        case SPI_ID_2 :
            return _SPI2CON_SIDL_MASK;
        case SPI_ID_4 :
            return _SPI4CON_SIDL_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_PIN_CONTROL_SDO_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_DISSDO_MASK;
        case SPI_ID_2 :
            return _SPI2CON_DISSDO_MASK;
        case SPI_ID_4 :
            return _SPI4CON_DISSDO_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_MODE32_COMMUNICATION_WIDTH_PIC32_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_MODE32_MASK;
        case SPI_ID_2 :
            return _SPI2CON_MODE32_MASK;
        case SPI_ID_4 :
            return _SPI4CON_MODE32_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_MODE16_COMMUNICATION_WIDTH_PIC32_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_MODE16_MASK;
        case SPI_ID_2 :
            return _SPI2CON_MODE16_MASK;
        case SPI_ID_4 :
            return _SPI4CON_MODE16_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

