MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/spi/processor/spi_p32mx695f512h.h
PLIB_INLINE SFR_DATA _SPI_INPUT_SAMPLE_PHASE_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_SMP_MASK;
        case SPI_ID_2 :
            return _SPI2CON_SMP_MASK;
        case SPI_ID_4 :
            return _SPI4CON_SMP_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_OUTPUT_DATA_PHASE_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_CKE_MASK;
        case SPI_ID_2 :
            return _SPI2CON_CKE_MASK;
        case SPI_ID_4 :
            return _SPI4CON_CKE_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_PIN_CONTROL_SS_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_SSEN_MASK;
        case SPI_ID_2 :
            return _SPI2CON_SSEN_MASK;
        case SPI_ID_4 :
            return _SPI4CON_SSEN_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_CLOCK_POLARITY_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_CKP_MASK;
        case SPI_ID_2 :
            return _SPI2CON_CKP_MASK;
        case SPI_ID_4 :
            return _SPI4CON_CKP_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_MASTER_CONTROL_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_MSTEN_MASK;
        case SPI_ID_2 :
            return _SPI2CON_MSTEN_MASK;
        case SPI_ID_4 :
            return _SPI4CON_MSTEN_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_TX_FIFO_INTERRUPT_MODE_PIC32_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_STXISEL_MASK;
        case SPI_ID_2 :
            return _SPI2CON_STXISEL_MASK;
        case SPI_ID_4 :
            return _SPI4CON_STXISEL_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_RX_FIFO_INTERRUPT_MODE_PIC32_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_SRXISEL_MASK;
        case SPI_ID_2 :
            return _SPI2CON_SRXISEL_MASK;
        case SPI_ID_4 :
            return _SPI4CON_SRXISEL_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_RX_FIFO_COUNT_PIC32_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_RXBUFELM_MASK;
        case SPI_ID_2 :
            return _SPI2STAT_RXBUFELM_MASK;
        case SPI_ID_4 :
            return _SPI4STAT_RXBUFELM_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_TX_FIFO_COUNT_PIC32_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_TXBUFELM_MASK;
        case SPI_ID_2 :
            return _SPI2STAT_TXBUFELM_MASK;
        case SPI_ID_4 :
            return _SPI4STAT_TXBUFELM_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_BUS_STATUS_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_SPIBUSY_MASK;
        case SPI_ID_2 :
            return _SPI2STAT_SPIBUSY_MASK;
        case SPI_ID_4 :
            return _SPI4STAT_SPIBUSY_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_TRANSMIT_UNDER_RUN_STATUS_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_SPITUR_MASK;
        case SPI_ID_2 :
            return _SPI2STAT_SPITUR_MASK;
        case SPI_ID_4 :
            return _SPI4STAT_SPITUR_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FIFO_REGISTER_EMPTY_STATUS_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_SRMT_MASK;
        case SPI_ID_2 :
            return _SPI2STAT_SRMT_MASK;
        case SPI_ID_4 :
            return _SPI4STAT_SRMT_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_RECEIVER_OVERFLOW_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_SPIROV_MASK;
        case SPI_ID_2 :
            return _SPI2STAT_SPIROV_MASK;
        case SPI_ID_4 :
            return _SPI4STAT_SPIROV_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_RECEIVE_FIFO_STATUS_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_SPIRBE_MASK;
        case SPI_ID_2 :
            return _SPI2STAT_SPIRBE_MASK;
        case SPI_ID_4 :
            return _SPI4STAT_SPIRBE_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_TRANSMIT_BUFFER_EMPTY_STATUS_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_SPITBE_MASK;
        case SPI_ID_2 :
            return _SPI2STAT_SPITBE_MASK;
        case SPI_ID_4 :
            return _SPI4STAT_SPITBE_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_TRANSMIT_BUFFER_FULL_STATUS_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_SPITBF_MASK;
        case SPI_ID_2 :
            return _SPI2STAT_SPITBF_MASK;
        case SPI_ID_4 :
            return _SPI4STAT_SPITBF_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_RECEIVE_BUFFER_STATUS_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_SPIRBF_MASK;
        case SPI_ID_2 :
            return _SPI2STAT_SPIRBF_MASK;
        case SPI_ID_4 :
            return _SPI4STAT_SPIRBF_MASK;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_BUFFER_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return (SFR_DATA)-1;
        case SPI_ID_2 :
            return (SFR_DATA)-1;
        case SPI_ID_4 :
            return (SFR_DATA)-1;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_BAUD_RATE_MASK(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return (SFR_DATA)-1;
        case SPI_ID_2 :
            return (SFR_DATA)-1;
        case SPI_ID_4 :
            return (SFR_DATA)-1;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAMED_COMMUNICATION_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_FRMEN_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_FRMEN_POSITION;
        case SPI_ID_4 :
            return _SPI4CON_FRMEN_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

