MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/spi/processor/spi_p32mx695f512h.h
PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_DIRECTION_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_FRMSYNC_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_FRMSYNC_POSITION;
        case SPI_ID_4 :
            return _SPI4CON_FRMSYNC_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_POLARITY_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_FRMPOL_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_FRMPOL_POSITION;
        case SPI_ID_4 :
            return _SPI4CON_FRMPOL_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_SLAVE_SELECT_CONTROL_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_MSSEN_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_MSSEN_POSITION;
        case SPI_ID_4 :
            return _SPI4CON_MSSEN_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_WIDTH_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_FRMSYPW_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_FRMSYPW_POSITION;
        case SPI_ID_4 :
            return _SPI4CON_FRMSYPW_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_COUNTER_PIC32_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_FRMCNT_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_FRMCNT_POSITION;
        case SPI_ID_4 :
            return _SPI4CON_FRMCNT_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_EDGE_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_SPIFE_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_SPIFE_POSITION;
        case SPI_ID_4 :
            return _SPI4CON_SPIFE_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FIFO_CONTROL_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_ENHBUF_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_ENHBUF_POSITION;
        case SPI_ID_4 :
            return _SPI4CON_ENHBUF_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_ENABLE_CONTROL_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_ON_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_ON_POSITION;
        case SPI_ID_4 :
            return _SPI4CON_ON_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_STOP_IN_IDLE_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_SIDL_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_SIDL_POSITION;
        case SPI_ID_4 :
            return _SPI4CON_SIDL_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_PIN_CONTROL_SDO_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_DISSDO_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_DISSDO_POSITION;
        case SPI_ID_4 :
            return _SPI4CON_DISSDO_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_MODE32_COMMUNICATION_WIDTH_PIC32_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_MODE32_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_MODE32_POSITION;
        case SPI_ID_4 :
            return _SPI4CON_MODE32_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_MODE16_COMMUNICATION_WIDTH_PIC32_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_MODE16_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_MODE16_POSITION;
        case SPI_ID_4 :
            return _SPI4CON_MODE16_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_INPUT_SAMPLE_PHASE_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_SMP_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_SMP_POSITION;
        case SPI_ID_4 :
            return _SPI4CON_SMP_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_OUTPUT_DATA_PHASE_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_CKE_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_CKE_POSITION;
        case SPI_ID_4 :
            return _SPI4CON_CKE_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_PIN_CONTROL_SS_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_SSEN_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_SSEN_POSITION;
        case SPI_ID_4 :
            return _SPI4CON_SSEN_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_CLOCK_POLARITY_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_CKP_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_CKP_POSITION;
        case SPI_ID_4 :
            return _SPI4CON_CKP_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_MASTER_CONTROL_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_MSTEN_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_MSTEN_POSITION;
        case SPI_ID_4 :
            return _SPI4CON_MSTEN_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

