MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/spi/processor/spi_p32mx695f512h.h
PLIB_INLINE SFR_DATA _SPI_TX_FIFO_INTERRUPT_MODE_PIC32_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_STXISEL_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_STXISEL_POSITION;
        case SPI_ID_4 :
            return _SPI4CON_STXISEL_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_RX_FIFO_INTERRUPT_MODE_PIC32_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_SRXISEL_POSITION;
        case SPI_ID_2 :
            return _SPI2CON_SRXISEL_POSITION;
        case SPI_ID_4 :
            return _SPI4CON_SRXISEL_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_RX_FIFO_COUNT_PIC32_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_RXBUFELM_POSITION;
        case SPI_ID_2 :
            return _SPI2STAT_RXBUFELM_POSITION;
        case SPI_ID_4 :
            return _SPI4STAT_RXBUFELM_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_TX_FIFO_COUNT_PIC32_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_TXBUFELM_POSITION;
        case SPI_ID_2 :
            return _SPI2STAT_TXBUFELM_POSITION;
        case SPI_ID_4 :
            return _SPI4STAT_TXBUFELM_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_BUS_STATUS_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_SPIBUSY_POSITION;
        case SPI_ID_2 :
            return _SPI2STAT_SPIBUSY_POSITION;
        case SPI_ID_4 :
            return _SPI4STAT_SPIBUSY_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_TRANSMIT_UNDER_RUN_STATUS_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_SPITUR_POSITION;
        case SPI_ID_2 :
            return _SPI2STAT_SPITUR_POSITION;
        case SPI_ID_4 :
            return _SPI4STAT_SPITUR_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FIFO_REGISTER_EMPTY_STATUS_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_SRMT_POSITION;
        case SPI_ID_2 :
            return _SPI2STAT_SRMT_POSITION;
        case SPI_ID_4 :
            return _SPI4STAT_SRMT_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_RECEIVER_OVERFLOW_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_SPIROV_POSITION;
        case SPI_ID_2 :
            return _SPI2STAT_SPIROV_POSITION;
        case SPI_ID_4 :
            return _SPI4STAT_SPIROV_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_RECEIVE_FIFO_STATUS_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_SPIRBE_POSITION;
        case SPI_ID_2 :
            return _SPI2STAT_SPIRBE_POSITION;
        case SPI_ID_4 :
            return _SPI4STAT_SPIRBE_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_TRANSMIT_BUFFER_EMPTY_STATUS_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_SPITBE_POSITION;
        case SPI_ID_2 :
            return _SPI2STAT_SPITBE_POSITION;
        case SPI_ID_4 :
            return _SPI4STAT_SPITBE_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_TRANSMIT_BUFFER_FULL_STATUS_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_SPITBF_POSITION;
        case SPI_ID_2 :
            return _SPI2STAT_SPITBF_POSITION;
        case SPI_ID_4 :
            return _SPI4STAT_SPITBF_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_RECEIVE_BUFFER_STATUS_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_SPIRBF_POSITION;
        case SPI_ID_2 :
            return _SPI2STAT_SPIRBF_POSITION;
        case SPI_ID_4 :
            return _SPI4STAT_SPIRBF_POSITION;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_BUFFER_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return (SFR_DATA)0;
        case SPI_ID_2 :
            return (SFR_DATA)0;
        case SPI_ID_4 :
            return (SFR_DATA)0;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_BAUD_RATE_POS(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return (SFR_DATA)0;
        case SPI_ID_2 :
            return (SFR_DATA)0;
        case SPI_ID_4 :
            return (SFR_DATA)0;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAMED_COMMUNICATION_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_FRMEN_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON_FRMEN_LENGTH;
        case SPI_ID_4 :
            return _SPI4CON_FRMEN_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_DIRECTION_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_FRMSYNC_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON_FRMSYNC_LENGTH;
        case SPI_ID_4 :
            return _SPI4CON_FRMSYNC_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_POLARITY_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_FRMPOL_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON_FRMPOL_LENGTH;
        case SPI_ID_4 :
            return _SPI4CON_FRMPOL_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

