MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/spi/processor/spi_p32mx695f512h.h
PLIB_INLINE SFR_DATA _SPI_SLAVE_SELECT_CONTROL_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_MSSEN_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON_MSSEN_LENGTH;
        case SPI_ID_4 :
            return _SPI4CON_MSSEN_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_WIDTH_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_FRMSYPW_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON_FRMSYPW_LENGTH;
        case SPI_ID_4 :
            return _SPI4CON_FRMSYPW_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_COUNTER_PIC32_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_FRMCNT_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON_FRMCNT_LENGTH;
        case SPI_ID_4 :
            return _SPI4CON_FRMCNT_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FRAME_SYNC_PULSE_EDGE_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_SPIFE_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON_SPIFE_LENGTH;
        case SPI_ID_4 :
            return _SPI4CON_SPIFE_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FIFO_CONTROL_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_ENHBUF_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON_ENHBUF_LENGTH;
        case SPI_ID_4 :
            return _SPI4CON_ENHBUF_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_ENABLE_CONTROL_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_ON_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON_ON_LENGTH;
        case SPI_ID_4 :
            return _SPI4CON_ON_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_STOP_IN_IDLE_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_SIDL_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON_SIDL_LENGTH;
        case SPI_ID_4 :
            return _SPI4CON_SIDL_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_PIN_CONTROL_SDO_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_DISSDO_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON_DISSDO_LENGTH;
        case SPI_ID_4 :
            return _SPI4CON_DISSDO_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_MODE32_COMMUNICATION_WIDTH_PIC32_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_MODE32_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON_MODE32_LENGTH;
        case SPI_ID_4 :
            return _SPI4CON_MODE32_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_MODE16_COMMUNICATION_WIDTH_PIC32_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_MODE16_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON_MODE16_LENGTH;
        case SPI_ID_4 :
            return _SPI4CON_MODE16_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_INPUT_SAMPLE_PHASE_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_SMP_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON_SMP_LENGTH;
        case SPI_ID_4 :
            return _SPI4CON_SMP_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_OUTPUT_DATA_PHASE_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_CKE_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON_CKE_LENGTH;
        case SPI_ID_4 :
            return _SPI4CON_CKE_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_PIN_CONTROL_SS_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_SSEN_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON_SSEN_LENGTH;
        case SPI_ID_4 :
            return _SPI4CON_SSEN_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_CLOCK_POLARITY_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_CKP_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON_CKP_LENGTH;
        case SPI_ID_4 :
            return _SPI4CON_CKP_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_MASTER_CONTROL_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_MSTEN_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON_MSTEN_LENGTH;
        case SPI_ID_4 :
            return _SPI4CON_MSTEN_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_TX_FIFO_INTERRUPT_MODE_PIC32_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_STXISEL_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON_STXISEL_LENGTH;
        case SPI_ID_4 :
            return _SPI4CON_STXISEL_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_RX_FIFO_INTERRUPT_MODE_PIC32_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3CON_SRXISEL_LENGTH;
        case SPI_ID_2 :
            return _SPI2CON_SRXISEL_LENGTH;
        case SPI_ID_4 :
            return _SPI4CON_SRXISEL_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_RX_FIFO_COUNT_PIC32_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_RXBUFELM_LENGTH;
        case SPI_ID_2 :
            return _SPI2STAT_RXBUFELM_LENGTH;
        case SPI_ID_4 :
            return _SPI4STAT_RXBUFELM_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_TX_FIFO_COUNT_PIC32_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_TXBUFELM_LENGTH;
        case SPI_ID_2 :
            return _SPI2STAT_TXBUFELM_LENGTH;
        case SPI_ID_4 :
            return _SPI4STAT_TXBUFELM_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_BUS_STATUS_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_SPIBUSY_LENGTH;
        case SPI_ID_2 :
            return _SPI2STAT_SPIBUSY_LENGTH;
        case SPI_ID_4 :
            return _SPI4STAT_SPIBUSY_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_TRANSMIT_UNDER_RUN_STATUS_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_SPITUR_LENGTH;
        case SPI_ID_2 :
            return _SPI2STAT_SPITUR_LENGTH;
        case SPI_ID_4 :
            return _SPI4STAT_SPITUR_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_FIFO_REGISTER_EMPTY_STATUS_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_SRMT_LENGTH;
        case SPI_ID_2 :
            return _SPI2STAT_SRMT_LENGTH;
        case SPI_ID_4 :
            return _SPI4STAT_SRMT_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _SPI_RECEIVER_OVERFLOW_LEN(SPI_MODULE_ID i)
{
    switch (i) {
        case SPI_ID_3 :
            return _SPI3STAT_SPIROV_LENGTH;
        case SPI_ID_2 :
            return _SPI2STAT_SPIROV_LENGTH;
        case SPI_ID_4 :
            return _SPI4STAT_SPIROV_LENGTH;
        case SPI_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

