MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/spi/processor/spi_p32mx695f512h.h
PLIB_INLINE_API bool PLIB_SPI_TransmitBufferIsFull(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_TransmitBufferIsFull_Default(index);
        case SPI_ID_2 :
            return SPI_TransmitBufferIsFull_Default(index);
        case SPI_ID_4 :
            return SPI_TransmitBufferIsFull_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsTransmitBufferFullStatus(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsTransmitBufferFullStatus_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsTransmitBufferFullStatus_Default(index);
        case SPI_ID_4 :
            return SPI_ExistsTransmitBufferFullStatus_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_SPI_TransmitBufferIsEmpty(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_TransmitBufferIsEmpty_Default(index);
        case SPI_ID_2 :
            return SPI_TransmitBufferIsEmpty_Default(index);
        case SPI_ID_4 :
            return SPI_TransmitBufferIsEmpty_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsTransmitBufferEmptyStatus(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsTransmitBufferEmptyStatus_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsTransmitBufferEmptyStatus_Default(index);
        case SPI_ID_4 :
            return SPI_ExistsTransmitBufferEmptyStatus_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ReceiverBufferIsFull(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ReceiverBufferIsFull_Default(index);
        case SPI_ID_2 :
            return SPI_ReceiverBufferIsFull_Default(index);
        case SPI_ID_4 :
            return SPI_ReceiverBufferIsFull_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsReceiveBufferStatus(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsReceiveBufferStatus_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsReceiveBufferStatus_Default(index);
        case SPI_ID_4 :
            return SPI_ExistsReceiveBufferStatus_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_PinEnable(SPI_MODULE_ID index, SPI_PIN pin)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_PinEnable_PIC32_1(index, pin);
            break;
        case SPI_ID_2 :
            SPI_PinEnable_PIC32_1(index, pin);
            break;
        case SPI_ID_4 :
            SPI_PinEnable_PIC32_1(index, pin);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_SPI_PinDisable(SPI_MODULE_ID index, SPI_PIN pin)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_PinDisable_PIC32_1(index, pin);
            break;
        case SPI_ID_2 :
            SPI_PinDisable_PIC32_1(index, pin);
            break;
        case SPI_ID_4 :
            SPI_PinDisable_PIC32_1(index, pin);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsPinControl(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsPinControl_PIC32_1(index);
        case SPI_ID_2 :
            return SPI_ExistsPinControl_PIC32_1(index);
        case SPI_ID_4 :
            return SPI_ExistsPinControl_PIC32_1(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_CommunicationWidthSelect(SPI_MODULE_ID index, SPI_COMMUNICATION_WIDTH width)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_CommunicationWidthSelect_PIC32(index, width);
            break;
        case SPI_ID_2 :
            SPI_CommunicationWidthSelect_PIC32(index, width);
            break;
        case SPI_ID_4 :
            SPI_CommunicationWidthSelect_PIC32(index, width);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsCommunicationWidth(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsCommunicationWidth_PIC32(index);
        case SPI_ID_2 :
            return SPI_ExistsCommunicationWidth_PIC32(index);
        case SPI_ID_4 :
            return SPI_ExistsCommunicationWidth_PIC32(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_SPI_AudioCommunicationWidthSelect(SPI_MODULE_ID index, SPI_AUDIO_COMMUNICATION_WIDTH mode)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_AudioCommunicationWidthSelect_Unsupported(index, mode);
            break;
        case SPI_ID_2 :
            SPI_AudioCommunicationWidthSelect_Unsupported(index, mode);
            break;
        case SPI_ID_4 :
            SPI_AudioCommunicationWidthSelect_Unsupported(index, mode);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsAudioCommunicationWidth(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsAudioCommunicationWidth_Unsupported(index);
        case SPI_ID_2 :
            return SPI_ExistsAudioCommunicationWidth_Unsupported(index);
        case SPI_ID_4 :
            return SPI_ExistsAudioCommunicationWidth_Unsupported(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_InputSamplePhaseSelect(SPI_MODULE_ID index, SPI_INPUT_SAMPLING_PHASE phase)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_InputSamplePhaseSelect_Default(index, phase);
            break;
        case SPI_ID_2 :
            SPI_InputSamplePhaseSelect_Default(index, phase);
            break;
        case SPI_ID_4 :
            SPI_InputSamplePhaseSelect_Default(index, phase);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsInputSamplePhase(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsInputSamplePhase_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsInputSamplePhase_Default(index);
        case SPI_ID_4 :
            return SPI_ExistsInputSamplePhase_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

