MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/spi/processor/spi_p32mx695f512h.h
PLIB_INLINE_API void PLIB_SPI_OutputDataPhaseSelect(SPI_MODULE_ID index, SPI_OUTPUT_DATA_PHASE phase)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_OutputDataPhaseSelect_Default(index, phase);
            break;
        case SPI_ID_2 :
            SPI_OutputDataPhaseSelect_Default(index, phase);
            break;
        case SPI_ID_4 :
            SPI_OutputDataPhaseSelect_Default(index, phase);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsOutputDataPhase(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsOutputDataPhase_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsOutputDataPhase_Default(index);
        case SPI_ID_4 :
            return SPI_ExistsOutputDataPhase_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_ClockPolaritySelect(SPI_MODULE_ID index, SPI_CLOCK_POLARITY polarity)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_ClockPolaritySelect_Default(index, polarity);
            break;
        case SPI_ID_2 :
            SPI_ClockPolaritySelect_Default(index, polarity);
            break;
        case SPI_ID_4 :
            SPI_ClockPolaritySelect_Default(index, polarity);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsClockPolarity(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsClockPolarity_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsClockPolarity_Default(index);
        case SPI_ID_4 :
            return SPI_ExistsClockPolarity_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_MasterEnable(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_MasterEnable_Default(index);
            break;
        case SPI_ID_2 :
            SPI_MasterEnable_Default(index);
            break;
        case SPI_ID_4 :
            SPI_MasterEnable_Default(index);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_SPI_SlaveEnable(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_SlaveEnable_Default(index);
            break;
        case SPI_ID_2 :
            SPI_SlaveEnable_Default(index);
            break;
        case SPI_ID_4 :
            SPI_SlaveEnable_Default(index);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsMasterControl(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsMasterControl_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsMasterControl_Default(index);
        case SPI_ID_4 :
            return SPI_ExistsMasterControl_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_BaudRateSet(SPI_MODULE_ID index, uint32_t clockFrequency, uint32_t baudRate)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_BaudRateSet_Default(index, clockFrequency, baudRate);
            break;
        case SPI_ID_2 :
            SPI_BaudRateSet_Default(index, clockFrequency, baudRate);
            break;
        case SPI_ID_4 :
            SPI_BaudRateSet_Default(index, clockFrequency, baudRate);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsBaudRate(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsBaudRate_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsBaudRate_Default(index);
        case SPI_ID_4 :
            return SPI_ExistsBaudRate_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_SPI_IsBusy(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_IsBusy_Default(index);
        case SPI_ID_2 :
            return SPI_IsBusy_Default(index);
        case SPI_ID_4 :
            return SPI_IsBusy_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsBusStatus(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsBusStatus_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsBusStatus_Default(index);
        case SPI_ID_4 :
            return SPI_ExistsBusStatus_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_SPI_ReadDataIsSignExtended(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ReadDataIsSignExtended_Unsupported(index);
        case SPI_ID_2 :
            return SPI_ReadDataIsSignExtended_Unsupported(index);
        case SPI_ID_4 :
            return SPI_ReadDataIsSignExtended_Unsupported(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsReadDataSignStatus(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsReadDataSignStatus_Unsupported(index);
        case SPI_ID_2 :
            return SPI_ExistsReadDataSignStatus_Unsupported(index);
        case SPI_ID_4 :
            return SPI_ExistsReadDataSignStatus_Unsupported(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_SlaveSelectEnable(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_SlaveSelectEnable_Default(index);
            break;
        case SPI_ID_2 :
            SPI_SlaveSelectEnable_Default(index);
            break;
        case SPI_ID_4 :
            SPI_SlaveSelectEnable_Default(index);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_SPI_SlaveSelectDisable(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_SlaveSelectDisable_Default(index);
            break;
        case SPI_ID_2 :
            SPI_SlaveSelectDisable_Default(index);
            break;
        case SPI_ID_4 :
            SPI_SlaveSelectDisable_Default(index);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

