MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/spi/processor/spi_p32mx695f512h.h
PLIB_INLINE_API bool PLIB_SPI_ExistsSlaveSelectControl(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsSlaveSelectControl_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsSlaveSelectControl_Default(index);
        case SPI_ID_4 :
            return SPI_ExistsSlaveSelectControl_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_SPI_TransmitUnderRunStatusGet(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_TransmitUnderRunStatusGet_Default(index);
        case SPI_ID_2 :
            return SPI_TransmitUnderRunStatusGet_Default(index);
        case SPI_ID_4 :
            return SPI_TransmitUnderRunStatusGet_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_TransmitUnderRunStatusClear(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_TransmitUnderRunStatusClear_Default(index);
            break;
        case SPI_ID_2 :
            SPI_TransmitUnderRunStatusClear_Default(index);
            break;
        case SPI_ID_4 :
            SPI_TransmitUnderRunStatusClear_Default(index);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsTransmitUnderRunStatus(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsTransmitUnderRunStatus_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsTransmitUnderRunStatus_Default(index);
        case SPI_ID_4 :
            return SPI_ExistsTransmitUnderRunStatus_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_FIFOEnable(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_FIFOEnable_Default(index);
            break;
        case SPI_ID_2 :
            SPI_FIFOEnable_Default(index);
            break;
        case SPI_ID_4 :
            SPI_FIFOEnable_Default(index);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_SPI_FIFODisable(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_FIFODisable_Default(index);
            break;
        case SPI_ID_2 :
            SPI_FIFODisable_Default(index);
            break;
        case SPI_ID_4 :
            SPI_FIFODisable_Default(index);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsFIFOControl(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsFIFOControl_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsFIFOControl_Default(index);
        case SPI_ID_4 :
            return SPI_ExistsFIFOControl_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API uint8_t PLIB_SPI_FIFOCountGet(SPI_MODULE_ID index, SPI_FIFO_TYPE type)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_FIFOCountGet_PIC32(index, type);
        case SPI_ID_2 :
            return SPI_FIFOCountGet_PIC32(index, type);
        case SPI_ID_4 :
            return SPI_FIFOCountGet_PIC32(index, type);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsFIFOCount(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsFIFOCount_PIC32(index);
        case SPI_ID_2 :
            return SPI_ExistsFIFOCount_PIC32(index);
        case SPI_ID_4 :
            return SPI_ExistsFIFOCount_PIC32(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ReceiverFIFOIsEmpty(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ReceiverFIFOIsEmpty_Default(index);
        case SPI_ID_2 :
            return SPI_ReceiverFIFOIsEmpty_Default(index);
        case SPI_ID_4 :
            return SPI_ReceiverFIFOIsEmpty_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsReceiveFIFOStatus(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsReceiveFIFOStatus_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsReceiveFIFOStatus_Default(index);
        case SPI_ID_4 :
            return SPI_ExistsReceiveFIFOStatus_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_SPI_FIFOShiftRegisterIsEmpty(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_FIFOShiftRegisterIsEmpty_Default(index);
        case SPI_ID_2 :
            return SPI_FIFOShiftRegisterIsEmpty_Default(index);
        case SPI_ID_4 :
            return SPI_FIFOShiftRegisterIsEmpty_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsFIFOShiftRegisterEmptyStatus(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsFIFOShiftRegisterEmptyStatus_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsFIFOShiftRegisterEmptyStatus_Default(index);
        case SPI_ID_4 :
            return SPI_ExistsFIFOShiftRegisterEmptyStatus_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_FIFOInterruptModeSelect(SPI_MODULE_ID index, SPI_FIFO_INTERRUPT mode)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_FIFOInterruptModeSelect_PIC32(index, mode);
            break;
        case SPI_ID_2 :
            SPI_FIFOInterruptModeSelect_PIC32(index, mode);
            break;
        case SPI_ID_4 :
            SPI_FIFOInterruptModeSelect_PIC32(index, mode);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsFIFOInterruptMode(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsFIFOInterruptMode_PIC32(index);
        case SPI_ID_2 :
            return SPI_ExistsFIFOInterruptMode_PIC32(index);
        case SPI_ID_4 :
            return SPI_ExistsFIFOInterruptMode_PIC32(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

