MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/spi/processor/spi_p32mx695f512h.h
PLIB_INLINE_API void PLIB_SPI_FramedCommunicationEnable(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_FramedCommunicationEnable_Default(index);
            break;
        case SPI_ID_2 :
            SPI_FramedCommunicationEnable_Default(index);
            break;
        case SPI_ID_4 :
            SPI_FramedCommunicationEnable_Default(index);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_SPI_FramedCommunicationDisable(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_FramedCommunicationDisable_Default(index);
            break;
        case SPI_ID_2 :
            SPI_FramedCommunicationDisable_Default(index);
            break;
        case SPI_ID_4 :
            SPI_FramedCommunicationDisable_Default(index);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsFramedCommunication(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsFramedCommunication_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsFramedCommunication_Default(index);
        case SPI_ID_4 :
            return SPI_ExistsFramedCommunication_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_FrameSyncPulseDirectionSelect(SPI_MODULE_ID index, SPI_FRAME_PULSE_DIRECTION direction)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_FrameSyncPulseDirectionSelect_Default(index, direction);
            break;
        case SPI_ID_2 :
            SPI_FrameSyncPulseDirectionSelect_Default(index, direction);
            break;
        case SPI_ID_4 :
            SPI_FrameSyncPulseDirectionSelect_Default(index, direction);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsFrameSyncPulseDirection(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsFrameSyncPulseDirection_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsFrameSyncPulseDirection_Default(index);
        case SPI_ID_4 :
            return SPI_ExistsFrameSyncPulseDirection_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_FrameSyncPulsePolaritySelect(SPI_MODULE_ID index, SPI_FRAME_PULSE_POLARITY polarity)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_FrameSyncPulsePolaritySelect_Default(index, polarity);
            break;
        case SPI_ID_2 :
            SPI_FrameSyncPulsePolaritySelect_Default(index, polarity);
            break;
        case SPI_ID_4 :
            SPI_FrameSyncPulsePolaritySelect_Default(index, polarity);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsFrameSyncPulsePolarity(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsFrameSyncPulsePolarity_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsFrameSyncPulsePolarity_Default(index);
        case SPI_ID_4 :
            return SPI_ExistsFrameSyncPulsePolarity_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_FrameSyncPulseEdgeSelect(SPI_MODULE_ID index, SPI_FRAME_PULSE_EDGE edge)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_FrameSyncPulseEdgeSelect_Default(index, edge);
            break;
        case SPI_ID_2 :
            SPI_FrameSyncPulseEdgeSelect_Default(index, edge);
            break;
        case SPI_ID_4 :
            SPI_FrameSyncPulseEdgeSelect_Default(index, edge);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsFrameSyncPulseEdge(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsFrameSyncPulseEdge_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsFrameSyncPulseEdge_Default(index);
        case SPI_ID_4 :
            return SPI_ExistsFrameSyncPulseEdge_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_FrameSyncPulseWidthSelect(SPI_MODULE_ID index, SPI_FRAME_PULSE_WIDTH width)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_FrameSyncPulseWidthSelect_Default(index, width);
            break;
        case SPI_ID_2 :
            SPI_FrameSyncPulseWidthSelect_Default(index, width);
            break;
        case SPI_ID_4 :
            SPI_FrameSyncPulseWidthSelect_Default(index, width);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsFrameSyncPulseWidth(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsFrameSyncPulseWidth_Default(index);
        case SPI_ID_2 :
            return SPI_ExistsFrameSyncPulseWidth_Default(index);
        case SPI_ID_4 :
            return SPI_ExistsFrameSyncPulseWidth_Default(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_SPI_FrameSyncPulseCounterSelect(SPI_MODULE_ID index, SPI_FRAME_SYNC_PULSE pulse)
{
    switch (index) {
        case SPI_ID_3 :
            SPI_FrameSyncPulseCounterSelect_PIC32(index, pulse);
            break;
        case SPI_ID_2 :
            SPI_FrameSyncPulseCounterSelect_PIC32(index, pulse);
            break;
        case SPI_ID_4 :
            SPI_FrameSyncPulseCounterSelect_PIC32(index, pulse);
            break;
        case SPI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_SPI_ExistsFrameSyncPulseCounter(SPI_MODULE_ID index)
{
    switch (index) {
        case SPI_ID_3 :
            return SPI_ExistsFrameSyncPulseCounter_PIC32(index);
        case SPI_ID_2 :
            return SPI_ExistsFrameSyncPulseCounter_PIC32(index);
        case SPI_ID_4 :
            return SPI_ExistsFrameSyncPulseCounter_PIC32(index);
        case SPI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

